## :x: Apply Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/20915070774)



<pre><code>Error: Error when reading or editing Resource &#34;artifactregistry repository \&#34;projects/kyma-project/locations/europe/repositories/restricted-prod\&#34;&#34; with IAM Member: Role &#34;roles/artifactregistry.writer&#34; Member &#34;group:kyma-restricted-registry-prod-write@sap.com&#34;: Error retrieving IAM policy for artifactregistry repository &#34;projects/kyma-project/locations/europe/repositories/restricted-prod&#34;: googleapi: Error 403: The caller does not have permission

  with google_artifact_registry_repository_iam_member.restricted_prod_writers,
  on restricted-registry.tf line 159, in resource &#34;google_artifact_registry_repository_iam_member&#34; &#34;restricted_prod_writers&#34;:
 159: resource &#34;google_artifact_registry_repository_iam_member&#34; &#34;restricted_prod_writers&#34; {


Error: Error when reading or editing Resource &#34;artifactregistry repository \&#34;projects/kyma-project/locations/europe/repositories/restricted-dev\&#34;&#34; with IAM Member: Role &#34;roles/artifactregistry.writer&#34; Member &#34;group:kyma-restricted-registry-dev-write@sap.com&#34;: Error retrieving IAM policy for artifactregistry repository &#34;projects/kyma-project/locations/europe/repositories/restricted-dev&#34;: googleapi: Error 403: The caller does not have permission

  with google_artifact_registry_repository_iam_member.restricted_dev_writers,
  on restricted-registry.tf line 168, in resource &#34;google_artifact_registry_repository_iam_member&#34; &#34;restricted_dev_writers&#34;:
 168: resource &#34;google_artifact_registry_repository_iam_member&#34; &#34;restricted_dev_writers&#34; {


Error: Error when reading or editing Resource &#34;artifactregistry repository \&#34;projects/kyma-project/locations/europe/repositories/restricted-dev\&#34;&#34; with IAM Member: Role &#34;roles/artifactregistry.reader&#34; Member &#34;group:kyma-restricted-registry-dev-read@sap.com&#34;: Error retrieving IAM policy for artifactregistry repository &#34;projects/kyma-project/locations/europe/repositories/restricted-dev&#34;: googleapi: Error 403: The caller does not have permission

  with module.restricted_dev.google_artifact_registry_repository_iam_member.reader_access[&#34;group:kyma-restricted-registry-dev-read@sap.com&#34;],
  on ../../modules/artifact-registry/main.tf line 216, in resource &#34;google_artifact_registry_repository_iam_member&#34; &#34;reader_access&#34;:
 216: resource &#34;google_artifact_registry_repository_iam_member&#34; &#34;reader_access&#34; {


Error: Error when reading or editing Resource &#34;artifactregistry repository \&#34;projects/kyma-project/locations/europe/repositories/restricted-prod\&#34;&#34; with IAM Member: Role &#34;roles/artifactregistry.reader&#34; Member &#34;group:kyma-restricted-registry-prod-read@sap.com&#34;: Error retrieving IAM policy for artifactregistry repository &#34;projects/kyma-project/locations/europe/repositories/restricted-prod&#34;: googleapi: Error 403: The caller does not have permission

  with module.restricted_prod.google_artifact_registry_repository_iam_member.reader_access[&#34;group:kyma-restricted-registry-prod-read@sap.com&#34;],
  on ../../modules/artifact-registry/main.tf line 216, in resource &#34;google_artifact_registry_repository_iam_member&#34; &#34;reader_access&#34;:
 216: resource &#34;google_artifact_registry_repository_iam_member&#34; &#34;reader_access&#34; {

::error::OpenTofu exited with code 1.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
github_actions_variable.github_terraform_executor_secret_name: Refreshing state... [id=test-infra:GH_TERRAFORM_EXECUTOR_SECRET_NAME]
github_actions_organization_variable.gcp_kyma_project_project_id: Refreshing state... [id=GCP_KYMA_PROJECT_PROJECT_ID]
data.github_organization.kyma_project: Reading...
github_actions_variable.github_terraform_planner_secret_name: Refreshing state... [id=test-infra:GH_TERRAFORM_PLANNER_SECRET_NAME]
data.github_repository.test_infra: Reading...
data.github_repository.gitleaks_repository["test-infra"]: Reading...
github_actions_organization_variable.image_builder_ado_pat_gcp_secret_name: Refreshing state... [id=IMAGE_BUILDER_ADO_PAT_GCP_SECRET_NAME]
data.github_repository.kyma_modules_internal: Reading...
google_service_account.kyma_project_image_builder: Refreshing state... [id=projects/kyma-project/serviceAccounts/azure-pipeline-image-builder@kyma-project.iam.gserviceaccount.com]
google_project_iam_member.kyma_developer_admin_private_logging_viewer: Refreshing state... [id=kyma-project/roles/logging.privateLogViewer/group:kyma_developer_admin@sap.com]
module.docker_cache.google_artifact_registry_repository.unprotected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/cache]
module.kyma_restricted_images_prod.data.google_client_config.this: Reading...
data.github_repository.kyma_modules_internal: Read complete after 0s [id=kyma-modules]
google_project_iam_member.kyma_developer_admin_editor: Refreshing state... [id=kyma-project/roles/editor/group:kyma_developer_admin@sap.com]
module.kyma_restricted_images_prod.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.docker_cache.data.google_client_config.this: Reading...
module.docker_cache.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.dev_docker_repository.data.google_client_config.this: Reading...
module.dev_docker_repository.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.chainguard_cache.data.google_client_config.this: Reading...
module.chainguard_cache.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.kyma_restricted_images_dev.data.google_client_config.this: Reading...
module.kyma_restricted_images_dev.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.kyma_modules.google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/kyma-modules]
module.dockerhub_mirror.data.google_client_config.this: Reading...
module.dockerhub_mirror.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.kyma_restricted_images_prod.google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/kyma-restricted-images-prod]
module.kyma_modules.data.google_client_config.this: Reading...
module.kyma_modules.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.dev_docker_repository.google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/dev]
data.google_project.kyma_project: Reading...
google_project_iam_member.kyma_developer_admin_logging_viewer: Refreshing state... [id=kyma-project/roles/logging.viewer/group:kyma_developer_admin@sap.com]
module.kyma_restricted_images_dev.google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/kyma-restricted-images-dev]
data.google_project.kyma_project: Read complete after 0s [id=projects/kyma-project]
module.prod_docker_repository.data.google_client_config.this: Reading...
module.prod_docker_repository.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.prod_docker_repository.google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/prod]
module.dev_kyma_modules.data.google_client_config.this: Reading...
module.dev_kyma_modules.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.dev_kyma_modules.google_artifact_registry_repository.unprotected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/dev-kyma-modules]
module.service_account_keys_rotator.google_project_service_identity.pubsub_identity_agent: Refreshing state... [id=projects/sap-kyma-prow/services/pubsub.googleapis.com]
module.signify_secret_rotator.google_service_account.signify_secret_rotator: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/signify-rotator@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.terraform-executor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.restricted-markets-artifactregistry-reader: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/restricted-markets-reg-reader@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.data.google_secret_manager_secret.common_slack_bot_token: Reading...
google_secret_manager_secret.sec-scanner-cfg-processor-gcp-sa-key: Refreshing state... [id=projects/sap-kyma-prow/secrets/sec-scanner-cfg-gcp-sa-key]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Refreshing state... [id=locations/europe-west1/namespaces/sap-kyma-prow/services/security-dashboard-token]
module.slack_message_sender.data.google_secret_manager_secret.common_slack_bot_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/common-slack-bot-token]
module.service_account_keys_rotator.data.google_project.project: Reading...
google_service_account.sa-security-dashboard-oauth: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-security-dashboard-oauth@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.google_service_account.slack_message_sender: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.data.google_monitoring_notification_channel.kyma_tooling: Reading...
google_dns_managed_zone.build_kyma: Refreshing state... [id=projects/sap-kyma-prow/managedZones/build-kyma]
google_service_account.kyma-oci-image-builder: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/kyma-oci-image-builder@sap-kyma-prow.iam.gserviceaccount.com]
data.google_secret_manager_secret_version.dockerhub_oat_secret[0]: Reading...
google_secret_manager_secret.kyma_bot_public_github_token: Refreshing state... [id=projects/sap-kyma-prow/secrets/kyma-bot-github-public-repo-token]
google_secret_manager_secret.chainguard_pull_token: Refreshing state... [id=projects/sap-kyma-prow/secrets/chainguard_auth_token]
module.service_account_keys_rotator.data.google_project.project: Read complete after 0s [id=projects/sap-kyma-prow]
module.cors_proxy.data.google_iam_policy.noauth: Reading...
module.cors_proxy.data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
google_service_account.terraform_executor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
google_pubsub_topic.secrets_rotator_dead_letter: Refreshing state... [id=projects/sap-kyma-prow/topics/secrets-rotator-dead-letter]
google_secret_manager_secret.internal_github_terraform_planner: Refreshing state... [id=projects/sap-kyma-prow/secrets/iac-bot-gh-tools-sap-terraform-planner-token]
google_secret_manager_secret.dora_integration_internal_github_token: Refreshing state... [id=projects/sap-kyma-prow/secrets/dora-integration-gh-tools-serviceuser-token]
module.service_account_keys_rotator.data.google_monitoring_notification_channel.kyma_tooling: Read complete after 0s [id=projects/sap-kyma-prow/notificationChannels/5909844679104799956]
module.signify_secret_rotator.data.google_project.project: Reading...
data.google_secret_manager_secret_version.dockerhub_oat_secret[0]: Read complete after 0s [id=projects/351981214969/secrets/docker_sap_org_service_auth_token/versions/1]
data.google_project.current: Reading...
google_service_account.secrets-rotator: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com]
google_secret_manager_secret.kyma_modules_runtime_internal_github_token: Refreshing state... [id=projects/sap-kyma-prow/secrets/kyma-prow-serviceuser-internal-github-token]
module.slack_message_sender.google_monitoring_alert_policy.slack_message_sender: Refreshing state... [id=projects/sap-kyma-prow/alertPolicies/17360148176148949136]
module.github_webhook_gateway.data.google_secret_manager_secret.gh_tools_kyma_bot_token: Reading...
module.signify_secret_rotator.data.google_project.project: Read complete after 0s [id=projects/sap-kyma-prow]
google_service_account.terraform_planner: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-planner@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.data.google_secret_manager_secret.webhook_token: Reading...
google_service_account.gitleaks-secret-accesor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/gitleaks-secret-accesor@sap-kyma-prow.iam.gserviceaccount.com]
data.google_project.current: Read complete after 0s [id=projects/sap-kyma-prow]
google_service_account.gitleaks_secret_accesor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/gitleaks-secret-accesor@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.google_service_account.github_webhook_gateway: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.data.google_secret_manager_secret.gh_tools_kyma_bot_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token]
google_service_account.kyma-submission-pipeline: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/kyma-submission-pipeline@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.data.google_secret_manager_secret.webhook_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/sap-tools-github-backlog-webhook-secret]
google_service_account.image_syncer_writer: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/image-syncer-writer@sap-kyma-prow.iam.gserviceaccount.com]
data.google_pubsub_topic.secret-manager-notifications-topic: Reading...
google_service_account.kyma-security-scanners: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/kyma-security-scanners@sap-kyma-prow.iam.gserviceaccount.com]
module.signify_secret_rotator.data.google_monitoring_notification_channel.kyma_tooling: Reading...
google_service_account.sa-secret-update: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-secret-update@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.kyma-modules-reader-modg: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/modg-vuln-mgmt-reg-reader@sap-kyma-prow.iam.gserviceaccount.com]
module.cors_proxy.google_cloud_run_service.cors_proxy: Refreshing state... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/cors-proxy]
module.service_account_keys_rotator.google_service_account.service_account_keys_rotator: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.google_pubsub_topic.issue_labeled: Refreshing state... [id=projects/sap-kyma-prow/topics/issue-labeled]
data.google_pubsub_topic.secret-manager-notifications-topic: Read complete after 1s [id=projects/sap-kyma-prow/topics/secret-manager-notifications]
module.security_dashboard_token.data.google_iam_policy.noauth: Reading...
module.security_dashboard_token.data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
google_service_account.terraform-planner: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-planner@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_cleaner.data.google_project.project: Reading...
google_service_account.sec-scanner-cfg-processor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sec-scanner-cfg-processor@sap-kyma-prow.iam.gserviceaccount.com]
data.github_repository.test_infra: Read complete after 3s [id=test-infra]
module.github_webhook_gateway.data.google_iam_policy.noauth: Reading...
module.github_webhook_gateway.data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
data.google_client_config.gcp: Reading...
google_service_account.image_syncer_reader: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/image-syncer-reader@sap-kyma-prow.iam.gserviceaccount.com]
module.signify_secret_rotator.data.google_monitoring_notification_channel.kyma_tooling: Read complete after 1s [id=projects/sap-kyma-prow/notificationChannels/5909844679104799956]
google_secret_manager_secret.internal_github_terraform_executor: Refreshing state... [id=projects/sap-kyma-prow/secrets/iac-bot-gh-tools-sap-terraform-executor-token]
google_service_account.neighbors-conduit-cli-builder: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/neighbors-conduit-cli-builder@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.sa-kyma-project: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-kyma-project@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_cleaner.google_service_account.service_account_keys_cleaner: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.sa-dev-kyma-project: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-dev-kyma-project@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_cleaner.data.google_project.project: Read complete after 0s [id=projects/sap-kyma-prow]
google_service_account_iam_member.restricted_markets_artifactregistry_reader_impersonation: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/restricted-markets-reg-reader@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator/serviceAccount:gcr-writer@sap-ti-dx-kyma-mps-dev.iam.gserviceaccount.com]
module.slack_message_sender.data.google_iam_policy.run_invoker: Reading...
module.slack_message_sender.data.google_iam_policy.run_invoker: Read complete after 0s [id=1526577908]
module.slack_message_sender.google_project_iam_member.project_run_invoker: Refreshing state... [id=sap-kyma-prow/roles/run.invoker/serviceAccount:slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
module.signify_secret_rotator.google_cloud_run_service.signify_secret_rotator: Refreshing state... [id=locations/europe-west4/namespaces/sap-kyma-prow/services/signify-secret-rotator]
module.slack_message_sender.google_secret_manager_secret_iam_member.slack_msg_sender_common_slack_bot_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/common-slack-bot-token/roles/secretmanager.secretAccessor/serviceAccount:slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.google_project_iam_binding.pubsub_project_token_creator: Refreshing state... [id=sap-kyma-prow/roles/iam.serviceAccountTokenCreator]
github_actions_organization_variable.dora_integration_public_github_token_gcp_secret_name: Refreshing state... [id=DORA_INTEGRATION_PUBLIC_GITHUB_TOKEN_GCP_SECRET_NAME]
data.github_repository.gitleaks_repository["test-infra"]: Read complete after 3s [id=test-infra]
data.google_secret_manager_secret_version.chainguard_pull_token_password: Reading...
data.google_client_config.gcp: Read complete after 0s [id=projects/"sap-kyma-prow"/regions/"europe-west4"/zones/<null>]
google_secret_manager_secret_iam_member.chainguard_token_artifactregistry_access: Refreshing state... [id=projects/sap-kyma-prow/secrets/chainguard_auth_token/roles/secretmanager.secretAccessor/serviceAccount:service-905162714753@gcp-sa-artifactregistry.iam.gserviceaccount.com]
google_project_iam_member.terraform_executor_prow_project_owner: Refreshing state... [id=sap-kyma-prow/roles/owner/serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
github_actions_variable.gcp_terraform_executor_service_account_email: Refreshing state... [id=test-infra:GCP_TERRAFORM_EXECUTOR_SERVICE_ACCOUNT_EMAIL]
module.service_account_keys_rotator.google_monitoring_alert_policy.service_account_keys_rotator_error_alert: Refreshing state... [id=projects/sap-kyma-prow/alertPolicies/8834342864758449670]
github_actions_variable.internal_github_terraform_planner_secret_name: Refreshing state... [id=test-infra:INTERNAL_GITHUB_TERRAFORM_PLANNER_SECRET_NAME]
github_actions_organization_variable.dora_integration_internal_github_token_gcp_secret_name: Refreshing state... [id=DORA_INTEGRATION_INTERNAL_GITHUB_TOKEN_GCP_SECRET_NAME]
data.google_secret_manager_secret_version.chainguard_pull_token_password: Read complete after 0s [id=projects/351981214969/secrets/chainguard_auth_token/versions/1]
module.signify_secret_rotator.google_project_iam_member.signify_secret_rotator_secret_version_accessor: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.secretAccessor/serviceAccount:signify-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.signify_secret_rotator.google_project_iam_member.signify_secret_rotator_secret_version_adder: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.secretVersionAdder/serviceAccount:signify-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.signify_secret_rotator.google_project_iam_member.service_account_keys_rotator_secret_version_viewer: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.viewer/serviceAccount:signify-rotator@sap-kyma-prow.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.kyma_modules_update_components_workflow_internal_token_reader: Refreshing state... [id=projects/sap-kyma-prow/secrets/kyma-prow-serviceuser-internal-github-token/roles/secretmanager.secretAccessor/principal://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-tools-sap/subject/repository_id:172960:repository_owner_id:2457:workflow:Update Component Version on Push]
github_actions_variable.kyma_modules_runtime_internal_github_token_gcp_secret_name: Refreshing state... [id=kyma-modules:KYMA_PROW_SERVICEUSER_INTERNAL_GITHUB_TOKEN_GCP_SECRET_NAME]
google_storage_bucket_iam_binding.planner_state_bucket_write_access: Refreshing state... [id=b/tf-state-kyma-project/roles/storage.objectUser]
github_actions_variable.gcp_terraform_planner_service_account_email: Refreshing state... [id=test-infra:GCP_TERRAFORM_PLANNER_SERVICE_ACCOUNT_EMAIL]
google_secret_manager_secret_iam_member.terraform_planner_internal_github_planner_secret_reader: Refreshing state... [id=projects/sap-kyma-prow/secrets/iac-bot-gh-tools-sap-terraform-planner-token/roles/secretmanager.secretAccessor/serviceAccount:terraform-planner@sap-kyma-prow.iam.gserviceaccount.com]
google_project_iam_member.terraform_planner_prow_project_read_access["roles/viewer"]: Refreshing state... [id=sap-kyma-prow/roles/viewer/serviceAccount:terraform-planner@sap-kyma-prow.iam.gserviceaccount.com]
google_project_iam_member.terraform_planner_prow_project_read_access["roles/iam.

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

       - "type"  = "production"
        } -> null
      - location               = "europe" -> null
      - mode                   = "VIRTUAL_REPOSITORY" -> null
      - name                   = "restricted-prod" -> null
      - project                = "kyma-project" -> null
      - repository_id          = "restricted-prod" -> null
      - terraform_labels       = {
          - "goog-terraform-provisioned" = "true"
          - "name"                       = "restricted-prod"
          - "owner"                      = "neighbors"
          - "type"                       = "production"
        } -> null
      - update_time            = "2026-01-12T10:58:47.437731Z" -> null

      - virtual_repository_config {
          - upstream_policies {
              - id         = "chainguard-cache" -> null
              - priority   = 50 -> null
              - repository = "projects/kyma-project/locations/europe/repositories/chainguard-cache" -> null
            }
          - upstream_policies {
              - id         = "kyma-restricted-images-prod" -> null
              - priority   = 100 -> null
              - repository = "projects/kyma-project/locations/europe/repositories/kyma-restricted-images-prod" -> null
            }
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

OpenTofu planned the following actions, but then encountered a problem:

  # google_cloud_identity_group.restricted_registry_dev_read will be created
  + resource "google_cloud_identity_group" "restricted_registry_dev_read" {
      + additional_group_keys = (known after apply)
      + create_time           = (known after apply)
      + description           = "Read-only access to Kyma Restricted Registry DEV environment"
      + display_name          = "Kyma Restricted Registry DEV Read Access"
      + id                    = (known after apply)
      + initial_group_config  = "EMPTY"
      + labels                = {
          + "cloudidentity.googleapis.com/groups.security" = ""
        }
      + name                  = (known after apply)
      + parent                = "customers/C00qml9xi"
      + update_time           = (known after apply)

      + group_key {
          + id = "kyma-restricted-registry-dev-read@sap.com"
        }
    }

  # google_cloud_identity_group.restricted_registry_dev_write will be created
  + resource "google_cloud_identity_group" "restricted_registry_dev_write" {
      + additional_group_keys = (known after apply)
      + create_time           = (known after apply)
      + description           = "Read-write access to Kyma Restricted Registry DEV environment"
      + display_name          = "Kyma Restricted Registry DEV Write Access"
      + id                    = (known after apply)
      + initial_group_config  = "EMPTY"
      + labels                = {
          + "cloudidentity.googleapis.com/groups.security" = ""
        }
      + name                  = (known after apply)
      + parent                = "customers/C00qml9xi"
      + update_time           = (known after apply)

      + group_key {
          + id = "kyma-restricted-registry-dev-write@sap.com"
        }
    }

  # google_cloud_identity_group.restricted_registry_prod_read will be created
  + resource "google_cloud_identity_group" "restricted_registry_prod_read" {
      + additional_group_keys = (known after apply)
      + create_time           = (known after apply)
      + description           = "Read-only access to Kyma Restricted Registry PROD environment"
      + display_name          = "Kyma Restricted Registry PROD Read Access"
      + id                    = (known after apply)
      + initial_group_config  = "EMPTY"
      + labels                = {
          + "cloudidentity.googleapis.com/groups.security" = ""
        }
      + name                  = (known after apply)
      + parent                = "customers/C00qml9xi"
      + update_time           = (known after apply)

      + group_key {
          + id = "kyma-restricted-registry-prod-read@sap.com"
        }
    }

  # google_cloud_identity_group.restricted_registry_prod_write will be created
  + resource "google_cloud_identity_group" "restricted_registry_prod_write" {
      + additional_group_keys = (known after apply)
      + create_time           = (known after apply)
      + description           = "Read-write access to Kyma Restricted Registry PROD environment"
      + display_name          = "Kyma Restricted Registry PROD Write Access"
      + id                    = (known after apply)
      + initial_group_config  = "EMPTY"
      + labels                = {
          + "cloudidentity.googleapis.com/groups.security" = ""
        }
      + name                  = (known after apply)
      + parent                = "customers/C00qml9xi"
      + update_time           = (known after apply)

      + group_key {
          + id = "kyma-restricted-registry-prod-write@sap.com"
        }
    }

  # module.chainguard_cache.google_artifact_registry_repository.protected_repository[0] will be created
  + resource "google_artifact_registry_repository" "protected_repository" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + description            = "Remote repository for Chainguard pull-through cache"
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "chainguard-cache"
          + "owner"                      = "neighbors"
          + "type"                       = "production"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + labels                 = {
          + "name"  = "chainguard-cache"
          + "owner" = "neighbors"
          + "type"  = "production"
        }
      + location               = "europe"
      + mode                   = "REMOTE_REPOSITORY"
      + name                   = (known after apply)
      + project                = "kyma-project"
      + repository_id          = "chainguard-cache"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "chainguard-cache"
          + "owner"                      = "neighbors"
          + "type"                       = "production"
        }
      + update_time            = (known after apply)

      + remote_repository_config {
          + description = "Chainguard upstream repository"

          + docker_repository {
              + public_repository = "DOCKER_HUB"

              + custom_repository {
                  + uri = "https://cgr.dev/"
                }
            }

          + upstream_credentials {
              + username_password_credentials {
                  + password_secret_version = "projects/351981214969/secrets/chainguard_auth_token/versions/1"
                  + username                = "ac2ef7e1fdf69e1bf40cd31e4a868af7cca02037/034e2363347226e7"
                }
            }
        }
    }

  # module.kyma_restricted_images_dev.google_artifact_registry_repository.protected_repository[0] will be created
  + resource "google_artifact_registry_repository" "protected_repository" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + description            = "Development restricted images for kyma-project"
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "kyma-restricted-images-dev"
          + "owner"                      = "neighbors"
          + "type"                       = "development"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + labels                 = {
          + "name"  = "kyma-restricted-images-dev"
          + "owner" = "neighbors"
          + "type"  = "development"
        }
      + location               = "europe"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "kyma-project"
      + repository_id          = "kyma-restricted-images-dev"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "kyma-restricted-images-dev"
          + "owner"                      = "neighbors"
          + "type"                       = "development"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-untagged"

          + condition {
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "UNTAGGED"
              + version_name_prefixes = []
            }
        }
      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-old-pr-images"

          + condition {
              + older_than            = "2592000s"
              + package_name_prefixes = []
              + tag_prefixes          = [
                  + "PR-",
                ]
              + tag_state             = "TAGGED"
              + version_name_prefixes = []
            }
        }

      + docker_config {
          + immutable_tags = false
        }
    }

  # module.kyma_restricted_images_prod.google_artifact_registry_repository.protected_repository[0] will be created
  + resource "google_artifact_registry_repository" "protected_repository" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + description            = "Production restricted images for kyma-project"
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "kyma-restricted-images-prod"
          + "owner"                      = "neighbors"
          + "type"                       = "production"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + labels                 = {
          + "name"  = "kyma-restricted-images-prod"
          + "owner" = "neighbors"
          + "type"  = "production"
        }
      + location               = "europe"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "kyma-project"
      + repository_id          = "kyma-restricted-images-prod"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "kyma-restricted-images-prod"
          + "owner"                      = "neighbors"
          + "type"                       = "production"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-untagged"

          + condition {
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "UNTAGGED"
              + version_name_prefixes = []
            }
        }

      + docker_config {
          + immutable_tags = false
        }
    }

  # module.restricted_dev.data.google_client_config.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_client_config" "this" {
      + access_token   = (sensitive value)
      + default_labels = (known after apply)
      + id             = (known after apply)
      + project        = (known after apply)
      + region         = (known after apply)
      + zone           = (known after apply)
    }

  # module.restricted_dev.google_artifact_registry_repository.protected_repository[0] will be created
  + resource "google_artifact_registry_repository" "protected_repository" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + description            = "Virtual repository for restricted development images"
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "restricted-dev"
          + "owner"                      = "neighbors"
          + "type"                       = "development"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + labels                 = {
          + "name"  = "restricted-dev"
          + "owner" = "neighbors"
          + "type"  = "development"
        }
      + location               = "europe"
      + mode                   = "VIRTUAL_REPOSITORY"
      + name                   = (known after apply)
      + project                = "kyma-project"
      + repository_id          = "restricted-dev"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "restricted-dev"
          + "owner"                      = "neighbors"
          + "type"                       = "development"
        }
      + update_time            = (known after apply)

      + docker_config {
          + immutable_tags = false
        }

      + virtual_repository_config {
          + upstream_policies {
              + id         = "kyma-restricted-images-dev"
              + priority   = 100
              + repository = "projects/kyma-project/locations/europe/repositories/kyma-restricted-images-dev"
            }
          + upstream_policies {
              + id         = "chainguard-cache"
              + priority   = 50
              + repository = "projects/kyma-project/locations/europe/repositories/chainguard-cache"
            }
        }
    }

  # module.restricted_prod.data.google_client_config.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_client_config" "this" {
      + access_token   = (sensitive value)
      + default_labels = (known after apply)
      + id             = (known after apply)
      + project        = (known after apply)
      + region         = (known after apply)
      + zone           = (known after apply)
    }

  # module.restricted_prod.google_artifact_registry_repository.protected_repository[0] will be created
  + resource "google_artifact_registry_repository" "protected_repository" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + description            = "Virtual repository for restricted production images"
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "restricted-prod"
          + "owner"                      = "neighbors"
          + "type"                       = "production"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + labels                 = {
          + "name"  = "restricted-prod"
          + "owner" = "neighbors"
          + "type"  = "production"
        }
      + location               = "europe"
      + mode                   = "VIRTUAL_REPOSITORY"
      + name                   = (known after apply)
      + project                = "kyma-project"
      + repository_id          = "restricted-prod"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "restricted-prod"
          + "owner"                      = "neighbors"
          + "type"                       = "production"
        }
      + update_time            = (known after apply)

      + docker_config {
          + immutable_tags = false
        }

      + virtual_repository_config {
          + upstream_policies {
              + id         = "kyma-restricted-images-prod"
              + priority   = 100
              + repository = "projects/kyma-project/locations/europe/repositories/kyma-restricted-images-prod"
            }
          + upstream_policies {
              + id         = "chainguard-cache"
              + priority   = 50
              + repository = "projects/kyma-project/locations/europe/repositories/chainguard-cache"
            }
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Error: Error when reading or editing Resource "artifactregistry repository \"projects/kyma-project/locations/europe/repositories/restricted-prod\"" with IAM Member: Role "roles/artifactregistry.writer" Member "group:kyma-restricted-registry-prod-write@sap.com": Error retrieving IAM policy for artifactregistry repository "projects/kyma-project/locations/europe/repositories/restricted-prod": googleapi: Error 403: The caller does not have permission

  with google_artifact_registry_repository_iam_member.restricted_prod_writers,
  on restricted-registry.tf line 159, in resource "google_artifact_registry_repository_iam_member" "restricted_prod_writers":
 159: resource "google_artifact_registry_repository_iam_member" "restricted_prod_writers" {


Error: Error when reading or editing Resource "artifactregistry repository \"projects/kyma-project/locations/europe/repositories/restricted-dev\"" with IAM Member: Role "roles/artifactregistry.writer" Member "group:kyma-restricted-registry-dev-write@sap.com": Error retrieving IAM policy for artifactregistry repository "projects/kyma-project/locations/europe/repositories/restricted-dev": googleapi: Error 403: The caller does not have permission

  with google_artifact_registry_repository_iam_member.restricted_dev_writers,
  on restricted-registry.tf line 168, in resource "google_artifact_registry_repository_iam_member" "restricted_dev_writers":
 168: resource "google_artifact_registry_repository_iam_member" "restricted_dev_writers" {


Error: Error when reading or editing Resource "artifactregistry repository \"projects/kyma-project/locations/europe/repositories/restricted-dev\"" with IAM Member: Role "roles/artifactregistry.reader" Member "group:kyma-restricted-registry-dev-read@sap.com": Error retrieving IAM policy for artifactregistry repository "projects/kyma-project/locations/europe/repositories/restricted-dev": googleapi: Error 403: The caller does not have permission

  with module.restricted_dev.google_artifact_registry_repository_iam_member.reader_access["group:kyma-restricted-registry-dev-read@sap.com"],
  on ../../modules/artifact-registry/main.tf line 216, in resource "google_artifact_registry_repository_iam_member" "reader_access":
 216: resource "google_artifact_registry_repository_iam_member" "reader_access" {


Error: Error when reading or editing Resource "artifactregistry repository \"projects/kyma-project/locations/europe/repositories/restricted-prod\"" with IAM Member: Role "roles/artifactregistry.reader" Member "group:kyma-restricted-registry-prod-read@sap.com": Error retrieving IAM policy for artifactregistry repository "projects/kyma-project/locations/europe/repositories/restricted-prod": googleapi: Error 403: The caller does not have permission

  with module.restricted_prod.google_artifact_registry_repository_iam_member.reader_access["group:kyma-restricted-registry-prod-read@sap.com"],
  on ../../modules/artifact-registry/main.tf line 216, in resource "google_artifact_registry_repository_iam_member" "reader_access":
 216: resource "google_artifact_registry_repository_iam_member" "reader_access" {

::error::OpenTofu exited with code 1.

```

</details>

`

<!-- github-comment: {"Command":"apply","JobName":"post-apply-prod-terraform","PRNumber":13695,"Program":"tfcmt","SHA1":"295c142a659ae78289af57534a1767a791b60cd3","Vars":{},"WorkflowName":"Post Apply Prod Terraform"} -->